.source/Tools/maven.org
#+TITLE: Maven



* 安装与使用

修改镜像源，增加 jar 包下载速度，比如使用阿里云的源，settings.xml:
#+BEGIN_SRC sgml
  <mirrors>
    <mirror>
      <id>alimaven</id>
      <name>aliyun maven</name>
      <url>http://maven.aliyun.com/nexus/content/groups/public/</url>
      <mirrorOf>central</mirrorOf>        
    </mirror>
  </mirrors>
#+END_SRC

使用 archetype(原型) 插件，生成项目:
#+BEGIN_SRC sh
  mvn -h

  mvn archetype:generate  # interactive

  mvn -B archetype:generate
    -DarchetypeGroupId=org.apache.maven.archetypes \
    -DarchetypeArtifactId=maven-archetype-webapp \
    -DgroupId=com.mycompany.app \
    -DartifactId=my-app   # new project one line
#+END_SRC

执行命令示例:
#+BEGIN_SRC sh
  # run task with lifecycle's phase
  mvn install
  mvn clean
  mvn clean install
  mvn clean install -U   # force refresh

  # run task with goal directly
  mvn default:install
  mvn archetype:help
#+END_SRC

依赖相关命令:
#+BEGIN_SRC sh
  mvn dependency:help

  mvn dependency:list
  mvn dependency:tree

  mvn dependency:copy
  mvn dependency:copy-dependencies
  mvn dependency:copy-dependencies -DoutputDirectory=/tmp/xxx -DincludeScope=compile

  # 坐标(coordinate): 'groupId:artifactId:version'
#+END_SRC

* 生命周期(Lifecycle)

包括以下三种
1. default，默认，用于构建项目:
2. clean，用于清理
3. site，用于搭建网站

default 是默认的生命周期(~Lifecycle~)，它包括很多步骤(~Phase~)，主要的有:
| Order | Phase    | 默认绑定的 Plugin:Goal                                       |
|-------+----------+--------------------------------------------------------------|
|     1 | validate | 空                                                           |
|     2 | compile  | resources:resources, compiler:compile                        |
|     3 | test     | resources:testResources, compiler:testCompile, surefire:test |
|     4 | package  | maven-war-plugin:3.2.0:war                                   |
|     5 | verify   | 空                                                           |
|     6 | install  | maven-install-plugin:2.5.2:install                           |
|     7 | deploy   | maven-deploy-plugin:2.8.2:deploy                             |

它的调用方式为:
#+BEGIN_SRC sh
  mvn install   # 将会依次调用 1-6 的 Phase，即执行每个 Phase 所绑定的 Goal
  mvn compile   # 如果只想编译，并不想测试、打包、安装，那么只需要执行到 compile 即可
#+END_SRC

另外，clean 用于清理，包括以下 phase:
- pre-clean
- clean
- post-clean

site 生命周期的 phase 有:
- pre-site
- site
- post-site
- site-deploy


* POM 参考

https://maven.apache.org/pom.html#What_is_the_POM

