Tools/maven.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-03-22 周五 01:30 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Maven</title>
<meta name="generator" content="Org mode">
<meta name="author" content="unname">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Maven</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9210e94">1. 安装与使用</a></li>
<li><a href="#org0235934">2. 生命周期(Lifecycle)</a></li>
<li><a href="#orgd57df46">3. POM 参考</a>
<ul>
<li><a href="#org6750822">3.1. POM(Project Object Model) 示例</a></li>
<li><a href="#orgcfeb867">3.2. Build Configuration</a></li>
<li><a href="#orgc92d1cf">3.3. 插件配置示例</a></li>
</ul>
</li>
<li><a href="#org12ae4cc">4. 插件</a>
<ul>
<li><a href="#orgf549ed9">4.1. TOMCAT插件</a></li>
<li><a href="#org1387166">4.2. 自定义插件</a></li>
</ul>
</li>
</ul>
</div>
</nav>



<section id="outline-container-org9210e94" class="outline-2">
<h2 id="org9210e94"><span class="section-number-2">1</span> 安装与使用</h2>
<div class="outline-text-2" id="text-1">
<p>
修改镜像源，增加 jar 包下载速度，比如使用阿里云的源，settings.xml:
</p>
<div class="org-src-container">
<pre class="src src-sgml">&lt;<span class="org-function-name">mirrors</span>&gt;
  &lt;<span class="org-function-name">mirror</span>&gt;
    &lt;<span class="org-function-name">id</span>&gt;alimaven&lt;/<span class="org-function-name">id</span>&gt;
    &lt;<span class="org-function-name">name</span>&gt;aliyun maven&lt;/<span class="org-function-name">name</span>&gt;
    &lt;<span class="org-function-name">url</span>&gt;http://maven.aliyun.com/nexus/content/groups/public/&lt;/<span class="org-function-name">url</span>&gt;
    &lt;<span class="org-function-name">mirrorOf</span>&gt;central&lt;/<span class="org-function-name">mirrorOf</span>&gt;        
  &lt;/<span class="org-function-name">mirror</span>&gt;
&lt;/<span class="org-function-name">mirrors</span>&gt;
</pre>
</div>

<p>
使用 archetype(原型) 插件，生成项目:
</p>
<div class="org-src-container">
<pre class="src src-sh">mvn -h

mvn archetype:generate  <span class="org-comment-delimiter"># </span><span class="org-comment">interactive</span>

mvn -B archetype:generate
  -DarchetypeGroupId=org.apache.maven.archetypes <span class="org-sh-escaped-newline">\</span>
  -DarchetypeArtifactId=maven-archetype-webapp <span class="org-sh-escaped-newline">\</span>
  -DgroupId=com.mycompany.app <span class="org-sh-escaped-newline">\</span>
  -DartifactId=my-app   <span class="org-comment-delimiter"># </span><span class="org-comment">new project one line</span>
</pre>
</div>

<p>
执行命令示例:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">run task with lifecycle's phase</span>
mvn install
mvn clean
mvn clean install
mvn clean install -U   <span class="org-comment-delimiter"># </span><span class="org-comment">force refresh</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">run task with goal directly</span>
mvn default:install
mvn archetype:help
</pre>
</div>

<p>
依赖相关命令:
</p>
<div class="org-src-container">
<pre class="src src-sh">mvn dependency:help

mvn dependency:list
mvn dependency:tree

mvn dependency:copy
mvn dependency:copy-dependencies
mvn dependency:copy-dependencies -DoutputDirectory=/tmp/xxx -DincludeScope=compile

<span class="org-comment-delimiter"># </span><span class="org-comment">&#22352;&#26631;(coordinate): 'groupId:artifactId:version'</span>
</pre>
</div>
</div>
</section>

<section id="outline-container-org0235934" class="outline-2">
<h2 id="org0235934"><span class="section-number-2">2</span> 生命周期(Lifecycle)</h2>
<div class="outline-text-2" id="text-2">
<p>
包括以下三种
</p>
<ol class="org-ol">
<li>default，默认，用于构建项目:</li>
<li>clean，用于清理</li>
<li>site，用于搭建网站</li>
</ol>

<p>
default 是默认的生命周期(<code>Lifecycle</code>)，它包括很多步骤(<code>Phase</code>)，主要的有:
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Order</th>
<th scope="col" class="org-left">Phase</th>
<th scope="col" class="org-left">默认绑定的 Plugin:Goal</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">validate</td>
<td class="org-left">空</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">compile</td>
<td class="org-left">resources:resources, compiler:compile</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">test</td>
<td class="org-left">resources:testResources, compiler:testCompile, surefire:test</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">package</td>
<td class="org-left">maven-war-plugin:3.2.0:war</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">verify</td>
<td class="org-left">空</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">install</td>
<td class="org-left">maven-install-plugin:2.5.2:install</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">deploy</td>
<td class="org-left">maven-deploy-plugin:2.8.2:deploy</td>
</tr>
</tbody>
</table>

<p>
它的调用方式为:
</p>
<div class="org-src-container">
<pre class="src src-sh">mvn install   <span class="org-comment-delimiter"># </span><span class="org-comment">&#23558;&#20250;&#20381;&#27425;&#35843;&#29992; 1-6 &#30340; Phase&#65292;&#21363;&#25191;&#34892;&#27599;&#20010; Phase &#25152;&#32465;&#23450;&#30340; Goal</span>
mvn compile   <span class="org-comment-delimiter"># </span><span class="org-comment">&#22914;&#26524;&#21482;&#24819;&#32534;&#35793;&#65292;&#24182;&#19981;&#24819;&#27979;&#35797;&#12289;&#25171;&#21253;&#12289;&#23433;&#35013;&#65292;&#37027;&#20040;&#21482;&#38656;&#35201;&#25191;&#34892;&#21040; compile &#21363;&#21487;</span>
</pre>
</div>

<p>
另外，clean 用于清理，包括以下 phase:
</p>
<ul class="org-ul">
<li>pre-clean</li>
<li>clean</li>
<li>post-clean</li>
</ul>

<p>
site 生命周期的 phase 有:
</p>
<ul class="org-ul">
<li>pre-site</li>
<li>site</li>
<li>post-site</li>
<li>site-deploy</li>
</ul>
</div>
</section>


<section id="outline-container-orgd57df46" class="outline-2">
<h2 id="orgd57df46"><span class="section-number-2">3</span> POM 参考</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://maven.apache.org/pom.html#What_is_the_POM">https://maven.apache.org/pom.html#What_is_the_POM</a>
</p>
</div>
