.source/Tools/maven.org
** POM(Project Object Model) 示例

#+BEGIN_SRC sgml
  <project xmlns="http://maven.apache.org/POM/4.0.0"
           xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
           xsi:schemaLocation="http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd">
    <modelVersion>4.0.0</modelVersion>

    <!-- The Basics -->
    <groupId>org.codehaus.mojo</groupId>
    <artifactId>my-project</artifactId>
    <version>1.0</version>
    <packaging>jar/war</packaging>

    <parent>...</parent>
    <dependencyManagement>...</dependencyManagement>

    <!-- Project Settings -->
    <modules>
      <module>xxx</module>
      <module>yyy</module>
    </modules>

    <properties>
      <project.build.sourceEncoding>UTF-8</project.build.sourceEncoding>
      <maven.compiler.source>1.8</maven.compiler.source>
      <maven.compiler.target>1.8</maven.compiler.target>
      <maven.compiler.compilerVersion>1.8</maven.compiler.compilerVersion>
      <xxx.version>1.22222</xxx.version>
    </properties>

    <dependencies>
      <dependency>
        <groupId>junit</groupId>
        <artifactId>junit</artifactId>
        <version>4.12 | [1.0] | (,1.2] | (,1.0],[1.2,) | LATEST | ${xxx.version}</version>
        <type>jar</type>
        <scope>compile/provided/runtime/test/system</scope>
        <optional>true</optional>
        <exclusions>
          <exclusion>
            <groupId>tgroupid</groupId>
            <artifactId>af</artifactId>
          </exclusion>
        </exclusions>
      </dependency>
    </dependencies>

    <!-- Build Settings -->
    <build>...</build>
    <reporting>...</reporting>

    <!-- More Project Information -->
    <name>...</name>
    <description>...</description>
    <url>...</url>
    <inceptionYear>...</inceptionYear>
    <licenses>...</licenses>
    <organization>...</organization>
    <developers>...</developers>
    <contributors>...</contributors>

    <!-- Environment Settings -->
    <repositories>
      <repository>
        <id>springsource-repo</id>
        <name>SpringSource Repository</name>
        <url>http://repo.springsource.org/release</url>
      </repository>
    </repositories>
    <distributionManagement>
      <repository>
        <id>mycompany-repository</id>
        <name>MyCompany Repository</name>
        <url>scp://repository.mycompany.com/repository/maven2</url>
      </repository>
    </distributionManagement>
    <issueManagement>...</issueManagement>
    <ciManagement>...</ciManagement>
    <mailingLists>...</mailingLists>
    <scm>...</scm>
    <prerequisites>...</prerequisites>
    <pluginRepositories>...</pluginRepositories>
    <profiles>...</profiles>
  </project>
#+END_SRC

** Build Configuration

#+BEGIN_SRC sgml
  <build>
    <finalName>xxx</finalName>

    <filters>
      <filter>src/main/filters/filter.properties</filter>
    </filters>

    <resources>
      <resource>
        <directory>src/main/resources</directory>
        <filtering>true</filtering>
      </resource>
    </resources>

    <plugins>
      <plugin>
        <groupId>org.apache.maven.plugins</groupId>
        <artifactId>maven-compiler-plugin</artifactId>
        <version>3.3</version>
        <configuration>
          <source>1.8</source>
          <target>1.8</target>
        </configuration>
      </plugin>
    </plugins>
  </build>
#+END_SRC

