Tools/maven.html

<div id="outline-container-org6750822" class="outline-3">
<h3 id="org6750822"><span class="section-number-3">3.1</span> POM(Project Object Model) 示例</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sgml">&lt;<span class="org-function-name">project</span> <span class="org-variable-name">xmlns</span>=<span class="org-string">"http://maven.apache.org/POM/4.0.0"</span>
         <span class="org-sgml-namespace">xmlns</span>:<span class="org-variable-name">xsi</span>=<span class="org-string">"http://www.w3.org/2001/XMLSchema-instance"</span>
         <span class="org-sgml-namespace">xsi</span>:<span class="org-variable-name">schemaLocation</span>=<span class="org-string">"http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd"</span>&gt;
  &lt;<span class="org-function-name">modelVersion</span>&gt;4.0.0&lt;/<span class="org-function-name">modelVersion</span>&gt;

  <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">The Basics </span><span class="org-comment-delimiter">--&gt;</span>
  &lt;<span class="org-function-name">groupId</span>&gt;org.codehaus.mojo&lt;/<span class="org-function-name">groupId</span>&gt;
  &lt;<span class="org-function-name">artifactId</span>&gt;my-project&lt;/<span class="org-function-name">artifactId</span>&gt;
  &lt;<span class="org-function-name">version</span>&gt;1.0&lt;/<span class="org-function-name">version</span>&gt;
  &lt;<span class="org-function-name">packaging</span>&gt;jar/war&lt;/<span class="org-function-name">packaging</span>&gt;

  &lt;<span class="org-function-name">parent</span>&gt;...&lt;/<span class="org-function-name">parent</span>&gt;
  &lt;<span class="org-function-name">dependencyManagement</span>&gt;...&lt;/<span class="org-function-name">dependencyManagement</span>&gt;

  <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Project Settings </span><span class="org-comment-delimiter">--&gt;</span>
  &lt;<span class="org-function-name">modules</span>&gt;
    &lt;<span class="org-function-name">module</span>&gt;xxx&lt;/<span class="org-function-name">module</span>&gt;
    &lt;<span class="org-function-name">module</span>&gt;yyy&lt;/<span class="org-function-name">module</span>&gt;
  &lt;/<span class="org-function-name">modules</span>&gt;

  &lt;<span class="org-function-name">properties</span>&gt;
    &lt;<span class="org-function-name">project.build.sourceEncoding</span>&gt;UTF-8&lt;/<span class="org-function-name">project.build.sourceEncoding</span>&gt;
    &lt;<span class="org-function-name">maven.compiler.source</span>&gt;1.8&lt;/<span class="org-function-name">maven.compiler.source</span>&gt;
    &lt;<span class="org-function-name">maven.compiler.target</span>&gt;1.8&lt;/<span class="org-function-name">maven.compiler.target</span>&gt;
    &lt;<span class="org-function-name">maven.compiler.compilerVersion</span>&gt;1.8&lt;/<span class="org-function-name">maven.compiler.compilerVersion</span>&gt;
    &lt;<span class="org-function-name">xxx.version</span>&gt;1.22222&lt;/<span class="org-function-name">xxx.version</span>&gt;
  &lt;/<span class="org-function-name">properties</span>&gt;

  &lt;<span class="org-function-name">dependencies</span>&gt;
    &lt;<span class="org-function-name">dependency</span>&gt;
      &lt;<span class="org-function-name">groupId</span>&gt;junit&lt;/<span class="org-function-name">groupId</span>&gt;
      &lt;<span class="org-function-name">artifactId</span>&gt;junit&lt;/<span class="org-function-name">artifactId</span>&gt;
      &lt;<span class="org-function-name">version</span>&gt;4.12 | [1.0] | (,1.2] | (,1.0],[1.2,) | LATEST | ${xxx.version}&lt;/<span class="org-function-name">version</span>&gt;
      &lt;<span class="org-function-name">type</span>&gt;jar&lt;/<span class="org-function-name">type</span>&gt;
      &lt;<span class="org-function-name">scope</span>&gt;compile/provided/runtime/test/system&lt;/<span class="org-function-name">scope</span>&gt;
      &lt;<span class="org-function-name">optional</span>&gt;true&lt;/<span class="org-function-name">optional</span>&gt;
      &lt;<span class="org-function-name">exclusions</span>&gt;
        &lt;<span class="org-function-name">exclusion</span>&gt;
          &lt;<span class="org-function-name">groupId</span>&gt;tgroupid&lt;/<span class="org-function-name">groupId</span>&gt;
          &lt;<span class="org-function-name">artifactId</span>&gt;af&lt;/<span class="org-function-name">artifactId</span>&gt;
        &lt;/<span class="org-function-name">exclusion</span>&gt;
      &lt;/<span class="org-function-name">exclusions</span>&gt;
    &lt;/<span class="org-function-name">dependency</span>&gt;
  &lt;/<span class="org-function-name">dependencies</span>&gt;

  <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Build Settings </span><span class="org-comment-delimiter">--&gt;</span>
  &lt;<span class="org-function-name">build</span>&gt;...&lt;/<span class="org-function-name">build</span>&gt;
  &lt;<span class="org-function-name">reporting</span>&gt;...&lt;/<span class="org-function-name">reporting</span>&gt;

  <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">More Project Information </span><span class="org-comment-delimiter">--&gt;</span>
  &lt;<span class="org-function-name">name</span>&gt;...&lt;/<span class="org-function-name">name</span>&gt;
  &lt;<span class="org-function-name">description</span>&gt;...&lt;/<span class="org-function-name">description</span>&gt;
  &lt;<span class="org-function-name">url</span>&gt;...&lt;/<span class="org-function-name">url</span>&gt;
  &lt;<span class="org-function-name">inceptionYear</span>&gt;...&lt;/<span class="org-function-name">inceptionYear</span>&gt;
  &lt;<span class="org-function-name">licenses</span>&gt;...&lt;/<span class="org-function-name">licenses</span>&gt;
  &lt;<span class="org-function-name">organization</span>&gt;...&lt;/<span class="org-function-name">organization</span>&gt;
  &lt;<span class="org-function-name">developers</span>&gt;...&lt;/<span class="org-function-name">developers</span>&gt;
  &lt;<span class="org-function-name">contributors</span>&gt;...&lt;/<span class="org-function-name">contributors</span>&gt;

  <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Environment Settings </span><span class="org-comment-delimiter">--&gt;</span>
  &lt;<span class="org-function-name">repositories</span>&gt;
    &lt;<span class="org-function-name">repository</span>&gt;
      &lt;<span class="org-function-name">id</span>&gt;springsource-repo&lt;/<span class="org-function-name">id</span>&gt;
      &lt;<span class="org-function-name">name</span>&gt;SpringSource Repository&lt;/<span class="org-function-name">name</span>&gt;
      &lt;<span class="org-function-name">url</span>&gt;http://repo.springsource.org/release&lt;/<span class="org-function-name">url</span>&gt;
    &lt;/<span class="org-function-name">repository</span>&gt;
  &lt;/<span class="org-function-name">repositories</span>&gt;
  &lt;<span class="org-function-name">distributionManagement</span>&gt;
    &lt;<span class="org-function-name">repository</span>&gt;
      &lt;<span class="org-function-name">id</span>&gt;mycompany-repository&lt;/<span class="org-function-name">id</span>&gt;
      &lt;<span class="org-function-name">name</span>&gt;MyCompany Repository&lt;/<span class="org-function-name">name</span>&gt;
      &lt;<span class="org-function-name">url</span>&gt;scp://repository.mycompany.com/repository/maven2&lt;/<span class="org-function-name">url</span>&gt;
    &lt;/<span class="org-function-name">repository</span>&gt;
  &lt;/<span class="org-function-name">distributionManagement</span>&gt;
  &lt;<span class="org-function-name">issueManagement</span>&gt;...&lt;/<span class="org-function-name">issueManagement</span>&gt;
  &lt;<span class="org-function-name">ciManagement</span>&gt;...&lt;/<span class="org-function-name">ciManagement</span>&gt;
  &lt;<span class="org-function-name">mailingLists</span>&gt;...&lt;/<span class="org-function-name">mailingLists</span>&gt;
  &lt;<span class="org-function-name">scm</span>&gt;...&lt;/<span class="org-function-name">scm</span>&gt;
  &lt;<span class="org-function-name">prerequisites</span>&gt;...&lt;/<span class="org-function-name">prerequisites</span>&gt;
  &lt;<span class="org-function-name">pluginRepositories</span>&gt;...&lt;/<span class="org-function-name">pluginRepositories</span>&gt;
  &lt;<span class="org-function-name">profiles</span>&gt;...&lt;/<span class="org-function-name">profiles</span>&gt;
&lt;/<span class="org-function-name">project</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcfeb867" class="outline-3">
<h3 id="orgcfeb867"><span class="section-number-3">3.2</span> Build Configuration</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-sgml">&lt;<span class="org-function-name">build</span>&gt;
  &lt;<span class="org-function-name">finalName</span>&gt;xxx&lt;/<span class="org-function-name">finalName</span>&gt;

  &lt;<span class="org-function-name">filters</span>&gt;
    &lt;<span class="org-function-name">filter</span>&gt;src/main/filters/filter.properties&lt;/<span class="org-function-name">filter</span>&gt;
  &lt;/<span class="org-function-name">filters</span>&gt;

  &lt;<span class="org-function-name">resources</span>&gt;
    &lt;<span class="org-function-name">resource</span>&gt;
      &lt;<span class="org-function-name">directory</span>&gt;src/main/resources&lt;/<span class="org-function-name">directory</span>&gt;
      &lt;<span class="org-function-name">filtering</span>&gt;true&lt;/<span class="org-function-name">filtering</span>&gt;
    &lt;/<span class="org-function-name">resource</span>&gt;
  &lt;/<span class="org-function-name">resources</span>&gt;

  &lt;<span class="org-function-name">plugins</span>&gt;
    &lt;<span class="org-function-name">plugin</span>&gt;
      &lt;<span class="org-function-name">groupId</span>&gt;org.apache.maven.plugins&lt;/<span class="org-function-name">groupId</span>&gt;
      &lt;<span class="org-function-name">artifactId</span>&gt;maven-compiler-plugin&lt;/<span class="org-function-name">artifactId</span>&gt;
      &lt;<span class="org-function-name">version</span>&gt;3.3&lt;/<span class="org-function-name">version</span>&gt;
      &lt;<span class="org-function-name">configuration</span>&gt;
        &lt;<span class="org-function-name">source</span>&gt;1.8&lt;/<span class="org-function-name">source</span>&gt;
        &lt;<span class="org-function-name">target</span>&gt;1.8&lt;/<span class="org-function-name">target</span>&gt;
      &lt;/<span class="org-function-name">configuration</span>&gt;
    &lt;/<span class="org-function-name">plugin</span>&gt;
  &lt;/<span class="org-function-name">plugins</span>&gt;
&lt;/<span class="org-function-name">build</span>&gt;
</pre>
</div>
</div>
</div>
