.source/Tools/maven.org
** 插件配置示例

插件分为两类:
- build plugin
- reporting plugin

配置示例:
#+BEGIN_SRC sgml
  <plugins>
    <plugin>
      <artifactId>maven-myquery-plugin</artifactId>
      <version>1.0</version>

      <configuration>
        <!-- 配置参数 -->
      </configuration>

      <dependencies>
        <!-- 配置依赖 -->
      </dependencies>

      <executions>
        <!-- 参与 lifecycle -->
        <execution>
          <id>execution1</id>
          <phase>test</phase>
          <goals>
            <goal>query</goal>
          </goals>
          <configuration>
            <url>http://www.foo.com/query</url>
            <timeout>10</timeout>
            <options><option>one</option><option>two</option><option>three</option></options>
          </configuration>
        </execution>

        <execution>
          <id>execution2</id>
          <goals><goal>query</goal></goals>
        </execution>

      </executions>
    </plugin>

    <plugin>
      <artifactId>maven-antrun-plugin</artifactId>
      <version>1.1</version>
      <executions>
        <execution>
          <id>echodir</id>
          <goals>
            <goal>run</goal>
          </goals>
          <phase>verify</phase>
          <inherited>false</inherited>
          <configuration>
            <tasks>
              <echo>Build Dir: ${project.build.directory}</echo>
            </tasks>
          </configuration>
        </execution>
      </executions>
    </plugin>
  </plugins>
#+END_SRC

* 插件
** TOMCAT插件

#+BEGIN_SRC sgml
  <plugin>   
    <groupId>org.apache.tomcat.maven</groupId>   
    <artifactId>tomcat7-maven-plugin</artifactId>   
    <version>2.2</version>   
    <configuration>      
      <hostName>localhost</hostName>    <!-- Default: localhost -->  
      <port>8080</port>                 <!-- Default: 8080 --> 
      <path>/ccc</path>                 <!-- Default: /${project.artifactId}-->  
      <uriEncoding>UTF-8</uriEncoding>  <!-- Default: ISO-8859-1 -->
    </configuration>
  </plugin>
#+END_SRC

运行:
#+BEGIN_SRC sh
  mvn tomcat7:run
  mvn tomcat7:help
  mvn tomcat7:deploy/undeply/redeploy
#+END_SRC

** 自定义插件

