Tools/maven.html

<div id="outline-container-orgc92d1cf" class="outline-3">
<h3 id="orgc92d1cf"><span class="section-number-3">3.3</span> 插件配置示例</h3>
<div class="outline-text-3" id="text-3-3">
<p>
插件分为两类:
</p>
<ul class="org-ul">
<li>build plugin</li>
<li>reporting plugin</li>
</ul>

<p>
配置示例:
</p>
<div class="org-src-container">
<pre class="src src-sgml">&lt;<span class="org-function-name">plugins</span>&gt;
  &lt;<span class="org-function-name">plugin</span>&gt;
    &lt;<span class="org-function-name">artifactId</span>&gt;maven-myquery-plugin&lt;/<span class="org-function-name">artifactId</span>&gt;
    &lt;<span class="org-function-name">version</span>&gt;1.0&lt;/<span class="org-function-name">version</span>&gt;

    &lt;<span class="org-function-name">configuration</span>&gt;
      <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#37197;&#32622;&#21442;&#25968; </span><span class="org-comment-delimiter">--&gt;</span>
    &lt;/<span class="org-function-name">configuration</span>&gt;

    &lt;<span class="org-function-name">dependencies</span>&gt;
      <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#37197;&#32622;&#20381;&#36182; </span><span class="org-comment-delimiter">--&gt;</span>
    &lt;/<span class="org-function-name">dependencies</span>&gt;

    &lt;<span class="org-function-name">executions</span>&gt;
      <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#21442;&#19982; lifecycle </span><span class="org-comment-delimiter">--&gt;</span>
      &lt;<span class="org-function-name">execution</span>&gt;
        &lt;<span class="org-function-name">id</span>&gt;execution1&lt;/<span class="org-function-name">id</span>&gt;
        &lt;<span class="org-function-name">phase</span>&gt;test&lt;/<span class="org-function-name">phase</span>&gt;
        &lt;<span class="org-function-name">goals</span>&gt;
          &lt;<span class="org-function-name">goal</span>&gt;query&lt;/<span class="org-function-name">goal</span>&gt;
        &lt;/<span class="org-function-name">goals</span>&gt;
        &lt;<span class="org-function-name">configuration</span>&gt;
          &lt;<span class="org-function-name">url</span>&gt;http://www.foo.com/query&lt;/<span class="org-function-name">url</span>&gt;
          &lt;<span class="org-function-name">timeout</span>&gt;10&lt;/<span class="org-function-name">timeout</span>&gt;
          &lt;<span class="org-function-name">options</span>&gt;&lt;<span class="org-function-name">option</span>&gt;one&lt;/<span class="org-function-name">option</span>&gt;&lt;<span class="org-function-name">option</span>&gt;two&lt;/<span class="org-function-name">option</span>&gt;&lt;<span class="org-function-name">option</span>&gt;three&lt;/<span class="org-function-name">option</span>&gt;&lt;/<span class="org-function-name">options</span>&gt;
        &lt;/<span class="org-function-name">configuration</span>&gt;
      &lt;/<span class="org-function-name">execution</span>&gt;

      &lt;<span class="org-function-name">execution</span>&gt;
        &lt;<span class="org-function-name">id</span>&gt;execution2&lt;/<span class="org-function-name">id</span>&gt;
        &lt;<span class="org-function-name">goals</span>&gt;&lt;<span class="org-function-name">goal</span>&gt;query&lt;/<span class="org-function-name">goal</span>&gt;&lt;/<span class="org-function-name">goals</span>&gt;
      &lt;/<span class="org-function-name">execution</span>&gt;

    &lt;/<span class="org-function-name">executions</span>&gt;
  &lt;/<span class="org-function-name">plugin</span>&gt;

  &lt;<span class="org-function-name">plugin</span>&gt;
    &lt;<span class="org-function-name">artifactId</span>&gt;maven-antrun-plugin&lt;/<span class="org-function-name">artifactId</span>&gt;
    &lt;<span class="org-function-name">version</span>&gt;1.1&lt;/<span class="org-function-name">version</span>&gt;
    &lt;<span class="org-function-name">executions</span>&gt;
      &lt;<span class="org-function-name">execution</span>&gt;
        &lt;<span class="org-function-name">id</span>&gt;echodir&lt;/<span class="org-function-name">id</span>&gt;
        &lt;<span class="org-function-name">goals</span>&gt;
          &lt;<span class="org-function-name">goal</span>&gt;run&lt;/<span class="org-function-name">goal</span>&gt;
        &lt;/<span class="org-function-name">goals</span>&gt;
        &lt;<span class="org-function-name">phase</span>&gt;verify&lt;/<span class="org-function-name">phase</span>&gt;
        &lt;<span class="org-function-name">inherited</span>&gt;false&lt;/<span class="org-function-name">inherited</span>&gt;
        &lt;<span class="org-function-name">configuration</span>&gt;
          &lt;<span class="org-function-name">tasks</span>&gt;
            &lt;<span class="org-function-name">echo</span>&gt;Build Dir: ${project.build.directory}&lt;/<span class="org-function-name">echo</span>&gt;
          &lt;/<span class="org-function-name">tasks</span>&gt;
        &lt;/<span class="org-function-name">configuration</span>&gt;
      &lt;/<span class="org-function-name">execution</span>&gt;
    &lt;/<span class="org-function-name">executions</span>&gt;
  &lt;/<span class="org-function-name">plugin</span>&gt;
&lt;/<span class="org-function-name">plugins</span>&gt;
</pre>
</div>
</div>
</div>
</section>

<section id="outline-container-org12ae4cc" class="outline-2">
<h2 id="org12ae4cc"><span class="section-number-2">4</span> 插件</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgf549ed9" class="outline-3">
<h3 id="orgf549ed9"><span class="section-number-3">4.1</span> TOMCAT插件</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-sgml">&lt;<span class="org-function-name">plugin</span>&gt;   
  &lt;<span class="org-function-name">groupId</span>&gt;org.apache.tomcat.maven&lt;/<span class="org-function-name">groupId</span>&gt;   
  &lt;<span class="org-function-name">artifactId</span>&gt;tomcat7-maven-plugin&lt;/<span class="org-function-name">artifactId</span>&gt;   
  &lt;<span class="org-function-name">version</span>&gt;2.2&lt;/<span class="org-function-name">version</span>&gt;   
  &lt;<span class="org-function-name">configuration</span>&gt;      
    &lt;<span class="org-function-name">hostName</span>&gt;localhost&lt;/<span class="org-function-name">hostName</span>&gt;    <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Default: localhost </span><span class="org-comment-delimiter">--&gt;</span>  
    &lt;<span class="org-function-name">port</span>&gt;8080&lt;/<span class="org-function-name">port</span>&gt;                 <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Default: 8080 </span><span class="org-comment-delimiter">--&gt;</span> 
    &lt;<span class="org-function-name">path</span>&gt;/ccc&lt;/<span class="org-function-name">path</span>&gt;                 <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Default: /${project.artifactId}</span><span class="org-comment-delimiter">--&gt;</span>  
    &lt;<span class="org-function-name">uriEncoding</span>&gt;UTF-8&lt;/<span class="org-function-name">uriEncoding</span>&gt;  <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Default: ISO-8859-1 </span><span class="org-comment-delimiter">--&gt;</span>
  &lt;/<span class="org-function-name">configuration</span>&gt;
&lt;/<span class="org-function-name">plugin</span>&gt;
</pre>
</div>

<p>
运行:
</p>
<div class="org-src-container">
<pre class="src src-sh">mvn tomcat7:run
mvn tomcat7:help
mvn tomcat7:deploy/undeply/redeploy
</pre>
</div>
</div>
</div>

<div id="outline-container-org1387166" class="outline-3">
<h3 id="org1387166"><span class="section-number-3">4.2</span> 自定义插件</h3>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: unname</p>
<p class="date">Created: 2019-03-22 周五 01:30</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
